// Generated by jextract

package tech.deplant.java4ever.binding.ffi;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$2 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$2() {}
    static final FunctionDescriptor const$0 = FunctionDescriptor.ofVoid(
        JAVA_INT,
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("content"),
            JAVA_INT.withName("len"),
            MemoryLayout.paddingLayout(4)
        ).withName(""),
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("content"),
            JAVA_INT.withName("len"),
            MemoryLayout.paddingLayout(4)
        ).withName(""),
        JAVA_INT,
        RuntimeHelper.POINTER
    );
    static final MethodHandle const$1 = RuntimeHelper.downcallHandle(
        "tc_request",
        constants$2.const$0
    );
    static final FunctionDescriptor const$2 = FunctionDescriptor.ofVoid(
        JAVA_INT,
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("content"),
            JAVA_INT.withName("len"),
            MemoryLayout.paddingLayout(4)
        ).withName(""),
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("content"),
            JAVA_INT.withName("len"),
            MemoryLayout.paddingLayout(4)
        ).withName(""),
        RuntimeHelper.POINTER,
        RuntimeHelper.POINTER
    );
    static final MethodHandle const$3 = RuntimeHelper.downcallHandle(
        "tc_request_ptr",
        constants$2.const$2
    );
    static final FunctionDescriptor const$4 = FunctionDescriptor.of(RuntimeHelper.POINTER,
        JAVA_INT,
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("content"),
            JAVA_INT.withName("len"),
            MemoryLayout.paddingLayout(4)
        ).withName(""),
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("content"),
            JAVA_INT.withName("len"),
            MemoryLayout.paddingLayout(4)
        ).withName("")
    );
    static final MethodHandle const$5 = RuntimeHelper.downcallHandle(
        "tc_request_sync",
        constants$2.const$4
    );
}


