// Generated by jextract

package tech.deplant.java4ever.binding.ffi;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$0 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$0() {}
    static final FunctionDescriptor tc_response_handler_t$FUNC = FunctionDescriptor.ofVoid(
        Constants$root.C_LONG$LAYOUT,
        MemoryLayout.structLayout(
            Constants$root.C_POINTER$LAYOUT.withName("content"),
            Constants$root.C_LONG$LAYOUT.withName("len"),
            MemoryLayout.paddingLayout(32)
        ),
        Constants$root.C_LONG$LAYOUT,
        Constants$root.C_BOOL$LAYOUT
    );
    static final FunctionDescriptor tc_response_handler_t_UP$FUNC = FunctionDescriptor.ofVoid(
        Constants$root.C_LONG$LAYOUT,
        MemoryLayout.structLayout(
            Constants$root.C_POINTER$LAYOUT.withName("content"),
            Constants$root.C_LONG$LAYOUT.withName("len"),
            MemoryLayout.paddingLayout(32)
        ),
        Constants$root.C_LONG$LAYOUT,
        Constants$root.C_BOOL$LAYOUT
    );
    static final MethodHandle tc_response_handler_t_UP$MH = RuntimeHelper.upcallHandle(tc_response_handler_t.class, "apply", constants$0.tc_response_handler_t_UP$FUNC);
    static final FunctionDescriptor tc_response_handler_t_DOWN$FUNC = FunctionDescriptor.ofVoid(
        Constants$root.C_LONG$LAYOUT,
        MemoryLayout.structLayout(
            Constants$root.C_POINTER$LAYOUT.withName("content"),
            Constants$root.C_LONG$LAYOUT.withName("len"),
            MemoryLayout.paddingLayout(32)
        ),
        Constants$root.C_LONG$LAYOUT,
        Constants$root.C_BOOL$LAYOUT
    );
    static final MethodHandle tc_response_handler_t_DOWN$MH = RuntimeHelper.downcallHandle(
        constants$0.tc_response_handler_t_DOWN$FUNC
    );
    static final FunctionDescriptor tc_response_handler_ptr_t$FUNC = FunctionDescriptor.ofVoid(
        Constants$root.C_POINTER$LAYOUT,
        MemoryLayout.structLayout(
            Constants$root.C_POINTER$LAYOUT.withName("content"),
            Constants$root.C_LONG$LAYOUT.withName("len"),
            MemoryLayout.paddingLayout(32)
        ),
        Constants$root.C_LONG$LAYOUT,
        Constants$root.C_BOOL$LAYOUT
    );
    static final FunctionDescriptor tc_response_handler_ptr_t_UP$FUNC = FunctionDescriptor.ofVoid(
        Constants$root.C_POINTER$LAYOUT,
        MemoryLayout.structLayout(
            Constants$root.C_POINTER$LAYOUT.withName("content"),
            Constants$root.C_LONG$LAYOUT.withName("len"),
            MemoryLayout.paddingLayout(32)
        ),
        Constants$root.C_LONG$LAYOUT,
        Constants$root.C_BOOL$LAYOUT
    );
    static final MethodHandle tc_response_handler_ptr_t_UP$MH = RuntimeHelper.upcallHandle(tc_response_handler_ptr_t.class, "apply", constants$0.tc_response_handler_ptr_t_UP$FUNC);
    static final FunctionDescriptor tc_response_handler_ptr_t_DOWN$FUNC = FunctionDescriptor.ofVoid(
        Constants$root.C_POINTER$LAYOUT,
        MemoryLayout.structLayout(
            Constants$root.C_POINTER$LAYOUT.withName("content"),
            Constants$root.C_LONG$LAYOUT.withName("len"),
            MemoryLayout.paddingLayout(32)
        ),
        Constants$root.C_LONG$LAYOUT,
        Constants$root.C_BOOL$LAYOUT
    );
    static final MethodHandle tc_response_handler_ptr_t_DOWN$MH = RuntimeHelper.downcallHandle(
        constants$0.tc_response_handler_ptr_t_DOWN$FUNC
    );
    static final FunctionDescriptor tc_create_context$FUNC = FunctionDescriptor.of(Constants$root.C_POINTER$LAYOUT,
        MemoryLayout.structLayout(
            Constants$root.C_POINTER$LAYOUT.withName("content"),
            Constants$root.C_LONG$LAYOUT.withName("len"),
            MemoryLayout.paddingLayout(32)
        )
    );
    static final MethodHandle tc_create_context$MH = RuntimeHelper.downcallHandle(
        "tc_create_context",
        constants$0.tc_create_context$FUNC
    );
    static final FunctionDescriptor tc_destroy_context$FUNC = FunctionDescriptor.ofVoid(
        Constants$root.C_LONG$LAYOUT
    );
    static final MethodHandle tc_destroy_context$MH = RuntimeHelper.downcallHandle(
        "tc_destroy_context",
        constants$0.tc_destroy_context$FUNC
    );
}


